using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAP
{
    public class Task18
    {
        // Neverwinter nights 1
        // Допустим у класса персонаж есть список его классов(мультиклассирование, самое имбовое - 1ур паладин, после качать только чародея).
        // Но ведь есть еще и престиж классы(Теневой вор Амна,Бледный мастер (Pale Master)...)
        // По сути Престиж классы наследуются от Базовых классов, ибо взять сразу престиж ты не можешь, можешь взять только при соблюдений условий( при получении любого уровня ты можешь испоганить билд взяв любой класс)
    }
}
