using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAP
{
    internal class Task6
    {
        // Reflexion
        // Тяжело представить dll модуль как часть Generic типа в C#

        // Существуют ли ситуации, когда связи между модулями должны делаться публичными?
        // Да, возможно когда именно сборка из модулей дает ощутимый результат\решение узконаправленной проблемы.

        // Какие метрики вы бы предложили для количественной оценки принципов организации модулей?   
        // Количество отношений с модулями предками родительских модулей.

        // Если вы разрабатывали программы, в которых было хотя бы 3-5 классов, как бы вы оценили их модульность по этим метрикам?
        // Чем больше тем хуже.


    }
}
