using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAP
{
    internal class Task3
    {
        // Рефлексия: Примеры у меня такие же, не знаю что писать.


        // ___
        // Сам класс может наследоваться только от одного класса, во избежании запутанности, если мы хотим добавить отдельный ряд логик или же
        // обязательств,то мы можем наследоваться от интерфейсов

        // Так же модификаторами доступа мы можем ограничить использование или наследование от потребителей.
        // Так в системной либе может быть гараздо больше классов, но доступа к ним извне не будет, только через те, что мы сами разрешим.
    }
}
